{"sections":{"main":{"type":"main-faqs-page","blocks":{"32e8a25e-8f82-447f-885c-c6cac15ea719":{"type":"paragraph","settings":{"title":"Shipping and Orders","question_1":"What is the status of my order? ","answer_1":"<p>To check the status of your order, go to <a href=\"https:\/\/soamazing.com\/account\">My Account<\/a>. Here’s what you’ll see under “Fulfillment Status”: \n<br><br>\n<strong>Preparing for shipment: <\/strong>Your order is currently being picked and processed. Once shipped, you will get an email with tracking information. \n<br><br>\n<strong>Shipped:<\/strong> Your order has left the building and is in the hands of the carrier. Use the tracking information associated with this order to follow its movement. \n<br><br>\n<strong>Delivered: <\/strong>Your order was successfully delivered to the provided shipping address. If you do not find it, please ask the members of your household and the carrier for further clarification. <\/p>","question_2":"How long will it take to receive my order? ","answer_2":"<p>Amazing Intimate Essentials owns and operates a state-of-the-art warehouse and shipping facility located in Cranston, Rhode Island. Our hours of operation are Monday through Friday, 8am – 5pm EST (not including holidays).   \n<br><br>\nAlthough we strive to fulfill and ship all orders the day they are received, there are certain variables that may extend this turnaround time – for example, holidays. Additionally, it is important to note that orders placed after 2pm EST will not ship until the next business day. As such, if an order is placed after 2pm EST on a Friday, it will not ship until Monday.   \n<br><br>\nTransit times are dependent on the shipping method chosen during checkout and the distance of your delivery location from our warehouse. International delivery speeds vary based on location and customs processing times.  \n<br><br>\nSee the full <a href=\"https:\/\/soamazing.com\/pages\/shipping-policy\">Shipping Policy<\/a> for more details. <\/p>","question_3":"Do you ship discreetly? ","answer_3":"<p>Absolutely! At Amazing Intimate Essentials, we take your privacy very seriously. As such, all our packages are shipped discreetly in a plain brown box or padded envelope free of any logos, or recognizable features. \n<br><br>\nThe shipping label is nondescript, displaying the sender's name as Metro. With these precautions in place, nobody will give your special delivery a second look! <\/p>","question_4":"How much does shipping cost? ","answer_4":"<p>Domestic orders over $49.00 ship <strong>FREE<\/strong> with economy postage.  Our flat rate postage rates are subsidized to pass saving to our customers. \n<br><br>\n<\/p><ul>\n<li>\n<strong>Economy:<\/strong> $8.00 - 5-8 Business Days (often faster than that)<\/li>\n<li>\n<strong>Standard:<\/strong> $11.00 - 2-3 Business Days <\/li>\n<li>\n<strong>Express:<\/strong> $23.00 – 1-2 Business Days <\/li>\n<\/ul>\n<br><br>\nInternational postage rates vary by weight and location. We use FedEx live rates to calculate these variables in real time so you can see your postage cost before you checkout. <p><\/p>","question_5":"Do you ship internationally? ","answer_5":"<p>Yes, we ship to many countries across the globe. When checking out just enter your international address and your postage rates will be calculated based on weight and location. Buyers are fully responsible for complying with their country's laws, Customs regulations, taxes, and duties. Amazing Intimate Essentials is not responsible for packages delayed or detained in Customs. <\/p>","question_6":"Can I cancel or change my order? ","answer_6":"<p>Depending on where your order is in processing, we may not be able to cancel, make additions, change, or stop them from shipping. If you want to try to cancel the order, be sure to contact <a href=\"https:\/\/soamazing.com\/pages\/contact-us\">customer service<\/a> immediately. <\/p>","question_7":"What carriers do you use for shipping? ","answer_7":"<p>For domestic shipping we use the United States Postal Service and FedEx at our discretion.<\/p>","question_8":"What happens if my shipment is lost? ","answer_8":"<p>The risk of loss or theft is passed to the customer upon delivery of the package by the carrier. All claims must be made to the carrier, by the customer.  <\/p>","question_9":"What is the Free Gift with Purchase promotion?","answer_9":"<p>Our Free Gift with Purchase promotion allows customers to receive a complimentary gift when they make a qualifying purchase on our website. This is our way of showing appreciation for your support and loyalty.<\/p>\n<p>To qualify for a Free Gift, your purchase must meet the specific criteria mentioned in the promotion's terms and conditions. These criteria could include a minimum order value, specific products, or other requirements. Please refer to the promotion details for accurate information.<\/p>\n<p>Please note that the number of Free Gifts you receive will be based on the terms of the promotion. Even if your cart contains a higher quantity of items, we will only ship the expected number of Free Gifts as stated in the promotion terms.<\/p>\n<p>If you believe there has been an oversight and you did not receive the correct number of Free Gifts as per the promotion terms, please contact our customer support team within 7 days of receiving your order. We'll be happy to assist you and ensure you receive the appropriate number of Free Gifts.<\/p>\n<p>If you decide to return any items from your order that qualified you for the Free Gift promotion, you will also need to return the Free Gift. If you have opened\/used or decide you want to keep the Free Gift, the retail price of the item will be deducted from your refund credit. Because the promotion is designed to reward qualifying purchases, returning those items would impact your eligibility for the Free Gift.<\/p>","question_10":"","answer_10":""}},"f4d12560-a07c-4bd4-a934-2a8eddeaccc9":{"type":"paragraph","settings":{"title":"Payments","question_1":"What forms of payment do you accept? ","answer_1":"<p>We accept all major credit cards (Visa, Mastercard, Discover, and American Express). We also accept Amazing Intimate Essentials Gift Cards. <\/p>","question_2":"Is my payment information secure? ","answer_2":"<p>Your credit card information is 100% secure! All information included with your order is encrypted for privacy while in transit.  <\/p>","question_3":"Will my payment be discreet on my statement? ","answer_3":"<p>Yes! We take your privacy very seriously. Charges on your statement will appear only as CVC-625 and will not link your purchase to this site or the nature of the order. <\/p>","question_4":"Why is my credit card not working? ","answer_4":"<p>If you are having a problem with your card, make sure that the billing address matches the address on file with your credit card and\/or bank. Enter the name and credit card number exactly the way you see it on the card. Before you place your order, add the CVV, a 3-digit code found on the back of your card. <\/p>","question_5":"How do I use my gift card or discount code? ","answer_5":"<p>Once you add an item to your cart and proceed to checkout you will see a field called “Gift Card or discount code”. Enter the code in that box and click “apply”. Any applicable discount or credit will then be applied to your order before you finalize checkout. Online gift cards cannot be used at our physical stores. <\/p>","question_6":"","answer_6":"","question_7":"","answer_7":"","question_8":"","answer_8":"","question_9":"","answer_9":"","question_10":"","answer_10":""}},"15d9d2f4-1bdd-49c8-9a99-58246020f05c":{"type":"paragraph","settings":{"title":"Support","question_1":"What if I received the wrong item? ","answer_1":"<p>If you have a discrepancy with your order, please reach out to Customer Support within seven (7) days of delivery and we will make it right!  <\/p>","question_2":"How do I unsubscribe from your emails? ","answer_2":"<p>You can unsubscribe by clicking on the unsubscribe link located at the top and bottom of each promotional email. You will receive an email confirming that your address has been removed from our lists. Please allow up to 48 hours for this to take effect. You may receive one or two promotional emails between the time you request to be removed from a list and the time that we are able to physically remove you from our database. We thank you for your patience. <\/p>","question_3":"","answer_3":"","question_4":"","answer_4":"","question_5":"","answer_5":"","question_6":"","answer_6":"","question_7":"","answer_7":"","question_8":"","answer_8":"","question_9":"","answer_9":"","question_10":"","answer_10":""}},"a5919c6e-243b-47ea-85ab-c24f3aefd605":{"type":"paragraph","settings":{"title":"Returns","question_1":"Start a Return","answer_1":"<p>For health and safety reasons, we do not accept returns. However, if you received a different item than what was ordered or your item has a defect, you may be able to be return it if authorized by our customer support team. If you believe your item meets these criteria, <a href=\"\/pages\/start-a-return\">fill out a Return Form<\/a> and a customer support agent will reach out to you All returns must be authorized by Customer Support before shipment. To see which items qualify and how to process a return, see the full <a href=\"\/pages\/return-policy\">Return Policy<\/a>. <\/p>","question_2":"I sent back an item without a Return Authorization Number. Will a refund be issued? ","answer_2":"<p>Unapproved returns will not be opened or processed due to health and safety concerns. If an item or order is received without prior approval, the sender will be responsible for any return shipping costs. See our <a href=\"\/pages\/start-a-return\">returns page<\/a> for details on how to get a return started!\n<\/p>","question_3":"Can I return my online purchase to an Amazing intimate Essentials retail store? ","answer_3":"<p>For the health and safety of our employees all returns must be processed, approved, assigned a Return Authorization Number, and shipped back to our warehouse location. We do not accept return as our retail locations. <\/p>","question_4":"Will my original shipping cost be refunded? ","answer_4":"A refund of your outbound shipping charge will not be processed unless your return is the result of our error.","question_5":"","answer_5":"","question_6":"","answer_6":"","question_7":"Canceling and Order","answer_7":"<p>Once an order has been processed, we are unable to make any additions, changes or quantity adjustments to it, or stop it from shipping.\n\nIf you changed your mind before the order is delivered, and no longer wish to receive the product, you can mark the UNOPENED box with “Return to sender” and send it back to us. Once we receive the order back, we will credit you for the cost of the product minus a 20% restocking fee. You will not receive credit for the shipping fee.\n\nIf you have any additional concerns about an order, please contact our customer service for help.\n<br>\nCustomer Service can be reached at <a href=\"\/pages\/contact-us\">Customer Support<\/a>.\n<br>\nYou can send an email to Customer Service 24 hours a day, 7 days a week. Customer Service will respond to your email within 24 hours on business days.<\/p>","question_8":"","answer_8":"","question_9":"","answer_9":"","question_10":"","answer_10":""}}},"block_order":["32e8a25e-8f82-447f-885c-c6cac15ea719","f4d12560-a07c-4bd4-a934-2a8eddeaccc9","15d9d2f4-1bdd-49c8-9a99-58246020f05c","a5919c6e-243b-47ea-85ab-c24f3aefd605"],"custom_css":[".contact-support-btn {border-radius: 6px; border-width: 2px; padding: 11px 20px !important;}"],"settings":{"show_breadcrumb":false,"breadcrumb_alignment":"left","breadcrumb_bg":"","breadcrumb_gradient":"","breadcrumb_bg_mb":"#f6f6f6","breadcrumb_gradient_mb":"","show_page_title":true,"page_title_alignment":"left","container":"1170","mg_top_desktop":0,"mg_top_tablet":0,"mg_top_mobile":0,"mg_bottom_desktop":25,"mg_bottom_tablet":0,"mg_bottom_mobile":20,"show_faqs_filter":true,"faqs_text":"<p>The below FAQ are some common concerns of our customers.\n<br> If you have other questions, please <a style=\"text-decoration: underline;\" onclick=\"GorgiasChat.open();\">Start a chat with our team<\/a>.<\/p>","faqs_message_heading":"","faqs_message_text":"","message_method_link_1":"https:\/\/facebook.com","message_method_text_1":"Message Us","message_method_link_2":"https:\/\/gmail.com","message_method_text_2":"Contact Us","contact_content_text":"Unable to find satisfactory answers ?","contact_text":"Contact Support","contact_link":"shopify:\/\/pages\/contact-us","contact_color":"#411d5b","contact_color_border":"#411d5b","contact_color_bg":"#ffffff","contact_color_bg_gradient":"","contact_color_hover":"#ffffff","contact_color_border_hover":"#411d5b","contact_color_bg_hover":"#411d5b","contact_color_bg_gradient_hover":""}}},"order":["main"]}